app/controllers/mobiles_controller.rb

SELECT COUNT(*) FROM "mobiles"
---
  def index
    @mobiles = Mobile.order(:source).page(params[:page]).per(5)

SELECT "mobiles".* FROM "mobiles" WHERE "mobiles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @mobile = Mobile.find(params[:id])

SELECT "mobiles".* FROM "mobiles" WHERE "mobiles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @mobile = Mobile.find(params[:id])

INSERT INTO "mobiles" ("created_at", "quotation", "source", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 11 Jan 2012 23:04:48 UTC +00:00], ["quotation", ""], ["source", "NOKIA"], ["updated_at", Wed, 11 Jan 2012 23:04:48 UTC +00:00]]
---
  def create
    @mobile = Mobile.new(params[:mobile])
    @mobile.save

SELECT "mobiles".* FROM "mobiles" WHERE "mobiles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @mobile = Mobile.find(params[:id])